Revit 2024 API
FabricationPart.ProductFinishDescription Property
 The product finish description of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public string ProductFinishDescription { get; }
Visual Basic
Public ReadOnly Property ProductFinishDescription As String
	Get
Visual C++
public:
property String^ ProductFinishDescription {
	String^ get ();
}
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace